1s/ERP/Conf/Documents/Лико_ВыполненныеРаботыМеждуОрганизациями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ВыполненныеРаботыМеждуОрганизациями</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦены</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОрганизацияПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадкаПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадкаПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыДокументаЛико_АктВыполненныхРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоглашениеПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоглашениеПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПартнерПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПартнерПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Служебный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Регистратор</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Лико_БланкЭтапа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Цены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеноваяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорПоставщика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорПокупателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоглашениеПоставщика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоглашениеПокупателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦены</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоглашениеПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоглашениеПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрагентПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПартнерПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрагентПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПартнерПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПлощадкаПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлощадкаПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ВыполненныеРаботыМеждуОрганизациями/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды   	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ЗаполнитьТаблицуТиповыеДокументы();

КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаботы

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыЦены

&НаКлиенте
Процедура ЦеныЦеноваяГруппаПриИзменении(Элемент)

	ЗаполнитьСтрокуТчЦеныДаннымиИзРегистра();
	РассчитатьНДС();

	
КонецПроцедуры


&НаКлиенте
Процедура ЦеныКоличествоПриИзменении(Элемент)
	
	ПересчетСуммы(); 
	РассчитатьНДС();

	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныЦенаПриИзменении(Элемент)
	
	ПересчетСуммы();
	РассчитатьНДС();

	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныСуммаПриИзменении(Элемент)
	
	ПересчетЦены(); 
	РассчитатьНДС();

	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныСтавкаНДСПриИзменении(Элемент)
	
	
	РассчитатьНДС();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоРаботам(Команда)
   ЗаполнитьПоРаботамСервер();
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТиповыеДокументы

&НаКлиенте
Процедура СписокТиповыеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Документ) Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Документ);
	КонецЕсли;
КонецПроцедуры


#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОрганизацияПоставщикаПриИзменении(Элемент)
	ОрганизацияПоставщикаПриИзмененииНаСервере();
КонецПроцедуры  

&НаКлиенте
Процедура ОрганизацияПокупателяПриИзменении(Элемент)
	ОрганизацияПокупателяПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТиповыеДокументы(Команда)
	ЗаполнитьТаблицуТиповыеДокументы();
КонецПроцедуры



//Основные каманды формы
&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	ЗаполнитьТаблицуТиповыеДокументы() ;
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры 
 //Основные каманды формы



// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда,Объект);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат); 
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды




#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОрганизацияПоставщикаПриИзмененииНаСервере()
	
	Объект.ПлощадкаПоставщика = Справочники.Лико_Площадки.ПлощадкаПоОрганизации(Объект.ОрганизацияПоставщика);
	Объект.КонтрагентПоставщика = КонтрагентПоОрганизацииСервер(Объект.ОрганизацияПоставщика); 
	Объект.ПартнерПоставщика = Объект.КонтрагентПоставщика.Партнер;
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПокупателяПриИзмененииНаСервере()
	
	Объект.ПлощадкаПокупателя = Справочники.Лико_Площадки.ПлощадкаПоОрганизации(Объект.ОрганизацияПокупателя);
	
	Объект.КонтрагентПокупателя = КонтрагентПоОрганизацииСервер(Объект.ОрганизацияПокупателя); 
	Объект.ПартнерПокупателя = Объект.КонтрагентПокупателя.Партнер;


КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуТиповыеДокументы() //+Лико m.shenderov 21.08.2018
	
	СписокТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("Ссылка",Объект.Ссылка);
	СписокТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("ПоказыватьДокумент",ЗначениеЗаполнено(Объект.Ссылка));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеИзРегистраПоЦГСоо(ПлощадкаПоставщика, ПлощадкаПокупателя, Период, знач _ЦеноваяГруппа=Неопределено)
	
		
	СооЦГ = РегистрыСведений.Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦены.ДанныеДляЗаполненияПоЦеновойГруппеСоо(
	ПлощадкаПоставщика,
	ПлощадкаПокупателя,
	Период,
	_ЦеноваяГруппа);
	
	
	Возврат СооЦГ
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТчЦеныДаннымиИзРегистра() 
	
	СооЦГ = ДанныеИзРегистраПоЦГСоо(
	Объект.ПлощадкаПоставщика,
	Объект.ПлощадкаПокупателя,
	Объект.Дата,
	Объект.Цены.Выгрузить().ВыгрузитьКолонку("ЦеноваяГруппа"));
	
	Для каждого СтрЦена Из Объект.Цены Цикл 
		
		СтруктураДанныхЦГ = СооЦГ[СтрЦена.ЦеноваяГруппа];
		
		Если ЗначениеЗаполнено(СтруктураДанныхЦГ) Тогда
			
			ЗаполнитьЗначенияСвойств(СтрЦена,СтруктураДанныхЦГ);
			
		КонецЕсли;
		
		
		
		
	КонецЦикла;
	
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьТчЦеныДаннымиИзРегистраСервер() 
	
	СооЦГ = ДанныеИзРегистраПоЦГСоо(
	Объект.ПлощадкаПоставщика,
	Объект.ПлощадкаПокупателя,
	Объект.Дата,
	Объект.Цены.Выгрузить().ВыгрузитьКолонку("ЦеноваяГруппа"));
	
	Для каждого СтрЦена Из Объект.Цены Цикл 
		
		СтруктураДанныхЦГ = СооЦГ[СтрЦена.ЦеноваяГруппа];
		
		Если ЗначениеЗаполнено(СтруктураДанныхЦГ) Тогда
			
			ЗаполнитьЗначенияСвойств(СтрЦена,СтруктураДанныхЦГ);
			
		КонецЕсли;
		
		
		
		
	КонецЦикла;
	
	
КонецПроцедуры 


&НаКлиенте
Процедура ЗаполнитьСтрокуТчЦеныДаннымиИзРегистра() 
	
	ТД = Элементы.Цены.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СооЦГ = ДанныеИзРегистраПоЦГСоо(Объект.ПлощадкаПоставщика,Объект.ПлощадкаПокупателя,Объект.Дата,ТД.ЦеноваяГруппа);
	
	СтруктураДанныхЦГ = СооЦГ[ТД.ЦеноваяГруппа];
	
	Если ЗначениеЗаполнено(СтруктураДанныхЦГ) Тогда
		
		ЗаполнитьЗначенияСвойств(ТД,СтруктураДанныхЦГ);
		
		ЗаполнитьЗначенияСвойств(Объект, СтруктураДанныхЦГ);
		
	КонецЕсли;
	
	
КонецПроцедуры 

&НаКлиенте
Процедура ПересчетСуммы()
	ТД = Элементы.Цены.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТД.Сумма = ТД.Количество*ТД.Цена;
	
КонецПроцедуры


&НаКлиенте
Процедура ПересчетЦены()
	
	ТД = Элементы.Цены.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТД.Количество = 0 Тогда
		Возврат;
	КонецЕсли;

	
	ТД.Цена = ТД.Сумма/ТД.Количество
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция КонтрагентПоОрганизацииСервер(Организация) 

Возврат УправлениеСвойствами.ЗначениеСвойства(Организация,"КонтрагентОрганизации_8e3f712fdca94791a890e1aa7853a0d2");
КонецФункции

&НаКлиенте
Процедура РассчитатьНДС()
	
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	ТекущаяСтрока = Элементы.Цены.ТекущиеДанные;

	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму","Количество");
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);

	
КонецПроцедуры 


&НаСервере
Процедура РассчитатьНДССервер(Данные)
	
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	

	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму","Количество");
	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Данные, СтруктураДействий, КэшированныеЗначения);

	
КонецПроцедуры 



&НаКлиенте
Процедура РассчитатьНДСТчЦеныСервер()
	
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	Для каждого СтрЦена Из Объект.Цены Цикл
		
		СтруктураДействий = Новый Структура;
		
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСумму","Количество");
		ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрЦена, СтруктураДействий, КэшированныеЗначения);
		
	
КонецЦикла;
	
		
	
	
КонецПроцедуры 

&НаКлиенте
Процедура НалогообложениеНДСПриИзменении(Элемент)
	РассчитатьНДСТчЦеныСервер();
КонецПроцедуры

&НаКлиенте
Процедура ЦенаВключаетНДСПриИзменении(Элемент)
	РассчитатьНДСТчЦеныСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоРаботамСервер()
	
	ЗаполнитьЦеновуюГруппуУРаботСервер();
	
	ТзРаботы = Объект.Работы.Выгрузить();
	ТзРаботы.Свернуть("ЦеноваяГруппа","Количество");
	
	Объект.Цены.Очистить();
	
	Для каждого СтрРабота Из ТзРаботы Цикл
		
		НоваяЦена = Объект.Цены.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЦена, СтрРабота); 
		
	КонецЦикла;
	ЗаполнитьТчЦеныДаннымиИзРегистраСервер();
	
	Для каждого СтрЦена Из Объект.Цены Цикл
		РассчитатьНДССервер(СтрЦена);
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеновуюГруппуУРаботСервер()
	
	Для каждого СтрРабота Из  Объект.Работы Цикл
		
		СтрРабота.ЦеноваяГруппа = СтрРабота.Номенклатура.ЦеноваяГруппа;
		
	КонецЦикла;
	
КонецПроцедуры 



#КонецОбласти
